Revit 2027 API
BuiltInFailures.LoadFailures.InvalidAreaLoadForceDistribution Property
 An area load cannot have forces distributed on both sides of the analytical panel. Please review the area load force parameters or the positions of the reference points and try again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidAreaLoadForceDistribution { get; }
Public Shared ReadOnly Property InvalidAreaLoadForceDistribution As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidAreaLoadForceDistribution {
	FailureDefinitionId^ get ();
}
static member InvalidAreaLoadForceDistribution : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace